[
    {
        "doc_id": "..more",
        "content": "Date: 17th April, 2025\nPress Release: FIU\nMoU between FIU-IND and RBI for enhanced coordination and information\nexchange.\nFIU-IND and RBI signed a Memorandum of Understanding (MoU) on 17th April,\n2025 at New Delhi, as part of continued coordinated efforts in effective\nimplementation of requirements of the Prevention of Money Laundering Act and\nRules framed thereunder.\nThe MoU was signed by Shri Vivek Aggarwal, Director, FIU-IND and Shri R L K\nRao, Executive Director, Department of Regulation, Reserve Bank of India.\nBedobani Chaudhuri, Additional Director, FIU-IND, Ms Veena Srivastava, Chief\nGeneral Manager, Department of Regulation, RBI, Shri Avinash Kumar, Deputy\nDirector, FIU-IND and Shri Sanjoy Ghosh, FSE, FIU-IND were also present on\nthe occasion.\nAccording to the MoU, FIU-IND and RBI will cooperate with each other in the\nareas of mutual interest including the following:\nI. Each Party to the MoU will appoint a nodal officer and an alternate nodal\nofficer to interact with the other party.\nII. Sharing of relevant intelligence and information, available in their\nrespective databases.\nIII. Laying down procedure and manner in which the regulated entities/\nreporting entities report to FIU-IND under the PML Rules.\nIV. Conducting outreach and training for regulated entities /reporting entities.\nV. Upgradation of Anti-Money Laundering/Combating Financing of\nTerrorism (AML/CFT) skills in the regulated entities / reporting entities\nregulated by RBI.\nVI. Assessment of Money Laundering/Terror Financing (ML/TF) risks and\nvulnerabilities in the relevant financial sub-sectors.\nVII. Identification of red flag indicators for Suspicious Transactions.\nVIII. Supervising and monitoring the compliance of reporting entities regulated\nby RBI with their obligations under PMLA, PML Rules and RBI\ninstructions.\nIX. Compliance with the relevant international standards.\nX. Conduct of quarterly meeting to discuss and share information on issues\nof mutual interest. Date: 17th April, 2025 Date: 17th April, 2025 ",
        "source_url": "https://fiuindia.gov.in/pdfs/downloads/FIU_RBI_MoU17042025.pdf"
    }
]